[
  {
    "id": 1,
    "text": "หากเห็นเพื่อนโกงข้อสอบ คุณควรทำอย่างไรเพื่อป้องกันการทุจริตในห้องเรียน?",
    "options": [
      "แกล้งทำเป็นมองไม่เห็นเพราะไม่อยากมีปัญหา",
      "เตือนเพื่อนด้วยเหตุผล และแจ้งครูหากยังทำต่อ",
      "ช่วยเพื่อนส่งโพยให้ครบทุกคนจะได้ยุติธรรม",
      "ถ่ายรูปลงโซเชียลเพื่อประจานเพื่อน"
    ],
    "optionScores": [50, 450, 200, 100],
    "bestIndex": 1
  },
  {
    "id": 2,
    "text": "หากเจ้าหน้าที่รัฐเรียกรับสินบนแลกกับการอำนวยความสะดวก คุณควรทำอย่างไร?",
    "options": [
      "ยอมจ่ายเพื่อให้เรื่องจบเร็ว",
      "ปฏิเสธและเก็บหลักฐานไว้เพื่อร้องเรียน",
      "จ่ายครึ่งหนึ่งและขอส่วนลด",
      "รับว่าผิดแต่ไม่กล้าทำอะไรต่อ"
    ],
    "optionScores": [100, 500, 150, 80],
    "bestIndex": 1
  },
  {
    "id": 3,
    "text": "เหตุใดการเปิดเผยข้อมูล (Transparency) จึงสำคัญในการป้องกันการทุจริต?",
    "options": [
      "ทำให้คนกลัวกฎหมายมากขึ้น",
      "ทำให้สาธารณชนตรวจสอบได้อย่างโปร่งใส",
      "ทำให้เอกสารเพิ่มขึ้นจนหาทุจริตไม่เจอ",
      "ใช้ได้เฉพาะกับหน่วยงานเอกชนเท่านั้น"
    ],
    "optionScores": [150, 450, 120, 70],
    "bestIndex": 1
  },
  {
    "id": 4,
    "text": "ข้อใดเป็นตัวอย่างของผลประโยชน์ทับซ้อน (Conflict of Interest)?",
    "options": [
      "ข้าราชการใช้เวลาว่างช่วยงานอาสาสมัคร",
      "กรรมการจัดซื้อให้บริษัทของญาติตนเองชนะประมูล",
      "นักเรียนช่วยเพื่อนทำการบ้าน",
      "ครูสนับสนุนให้นักเรียนทำกิจกรรมชมรม"
    ],
    "optionScores": [150, 480, 200, 150],
    "bestIndex": 1
  },
  {
    "id": 5,
    "text": "ถ้ามีผู้สมัครเลือกตั้งนักเรียนแจกของแลกกับเสียงโหวต ถือว่าควรทำอย่างไร?",
    "options": [
      "รับของแล้วโหวตให้ตามที่เขาขอ",
      "รับของแต่โหวตให้คนที่คิดว่าเหมาะสมที่สุด",
      "ไม่รับของและแจ้งครูหรือคณะกรรมการเลือกตั้งนักเรียน",
      "รับของและบอกเพื่อนให้ช่วยโหวตด้วย"
    ],
    "optionScores": [50, 200, 480, 150],
    "bestIndex": 2
  },
  {
    "id": 6,
    "text": "ผลเสียสำคัญของการทุจริตต่อประเทศคือข้อใด?",
    "options": [
      "ทำให้เศรษฐกิจเติบโตเร็วขึ้น",
      "ทำให้ทรัพยากรสูญเปล่าและประชาชนขาดความเชื่อมั่น",
      "ทำให้กฎหมายยืดหยุ่นมากขึ้น",
      "ทำให้การแข่งขันเป็นธรรมมากขึ้น"
    ],
    "optionScores": [50, 500, 100, 70],
    "bestIndex": 1
  },
  {
    "id": 7,
    "text": "การรายงานเบาะแสการทุจริต (Whistleblowing) อย่างปลอดภัยควรทำอย่างไร?",
    "options": [
      "โพสต์ลงโซเชียลมีเดียทันที",
      "ใช้ช่องทางร้องเรียนที่เป็นทางการและมีระบบคุ้มครองพยาน",
      "เล่าให้เพื่อนสนิทฟังเฉยๆ",
      "เก็บไว้คนเดียวเพราะกลัวมีปัญหา"
    ],
    "optionScores": [150, 480, 200, 80],
    "bestIndex": 1
  },
  {
    "id": 8,
    "text": "ข้อใดต่อไปนี้เป็นพฤติกรรมที่สะท้อน “ความซื่อสัตย์สุจริต” ในชีวิตประจำวัน?",
    "options": [
      "ลอกการบ้านเพื่อนเพราะไม่มีเวลา",
      "คืนเงินทอนที่ได้เกินจากร้านค้า",
      "โกงเกมเล็กน้อยเพราะไม่เดือดร้อนใคร",
      "แอบใช้ของสาธารณะไปทำธุระส่วนตัว"
    ],
    "optionScores": [100, 450, 150, 80],
    "bestIndex": 1
  },
  {
    "id": 9,
    "text": "ถ้าครูมอบหมายให้เป็นเหรัญญิกห้อง คุณควรปฏิบัติตนอย่างไรเพื่อลดโอกาสการทุจริต?",
    "options": [
      "เก็บเงินไว้คนเดียวและไม่ต้องรายงานใคร",
      "จดบันทึกทุกครั้งที่รับ–จ่ายและรายงานเพื่อนเป็นระยะ",
      "ใช้เงินก่อนแล้วค่อยหาเงินมาคืนทีหลัง",
      "ให้เพื่อนสนิทเป็นคนถือเงินแทน"
    ],
    "optionScores": [50, 480, 150, 120],
    "bestIndex": 1
  },
  {
    "id": 10,
    "text": "การจัดซื้ออุปกรณ์ในโรงเรียนอย่างโปร่งใสควรทำอย่างไร?",
    "options": [
      "เลือกร้านที่ครูสนิทที่สุด",
      "ให้เพียงคนเดียวตัดสินใจโดยไม่เปิดเผยราคา",
      "เปรียบเทียบราคาและคุณภาพจากหลายร้าน พร้อมบันทึกข้อมูลไว้ตรวจสอบได้",
      "ซื้อจากร้านเดิมทุกครั้งเพื่อลดขั้นตอน"
    ],
    "optionScores": [150, 100, 480, 200],
    "bestIndex": 2
  },
  {
    "id": 11,
    "text": "หากเพื่อนเสนอให้ช่วยกันแก้คะแนนในระบบเพื่อให้ทุกคนได้เกรดดีขึ้น ควรทำอย่างไร?",
    "options": [
      "ยอมทำเพราะเป็นประโยชน์แก่ทุกคน",
      "ปฏิเสธและอธิบายว่าเป็นการทุจริตทางการศึกษา",
      "ยอมทำเฉพาะของตัวเองเท่านั้น",
      "ให้เพื่อนทำ แต่ตัวเองไม่ข้องเกี่ยว"
    ],
    "optionScores": [50, 500, 150, 120],
    "bestIndex": 1
  },
  {
    "id": 12,
    "text": "ข้อใดคือหลักคิดสำคัญในการป้องกันการทุจริตในองค์กร?",
    "options": [
      "ความโปร่งใส ตรวจสอบได้ และรับผิดชอบต่อผลการตัดสินใจ",
      "การตัดสินใจที่รวดเร็วโดยไม่ต้องรายงาน",
      "การให้ผลตอบแทนพิเศษแก่ผู้มีอำนาจ",
      "การเก็บข้อมูลทุกอย่างเป็นความลับ"
    ],
    "optionScores": [480, 150, 80, 100],
    "bestIndex": 0
  },
  {
    "id": 13,
    "text": "หากพบเห็นครูหรือผู้ใหญ่ในโรงเรียนมีพฤติกรรมเข้าข่ายทุจริต คุณควรทำอย่างไร?",
    "options": [
      "ไม่ยุ่งเพราะกลัวเดือดร้อน",
      "เก็บหลักฐานและใช้ช่องทางร้องเรียนที่ปลอดภัยตามระเบียบโรงเรียน",
      "โพสต์ลงโซเชียลให้คนอื่นช่วยแชร์",
      "บอกเพื่อนให้ช่วยกันลือให้ทั่วโรงเรียน"
    ],
    "optionScores": [80, 480, 150, 100],
    "bestIndex": 1
  },
  {
    "id": 14,
    "text": "การปฏิเสธการลอกการบ้านเพื่อนมีผลดีอย่างไรต่อวัฒนธรรมในห้องเรียน?",
    "options": [
      "ทำให้เพื่อนโกรธแต่บรรยากาศดีขึ้นในระยะยาว",
      "ช่วยสร้างบรรทัดฐานของความรับผิดชอบและความซื่อสัตย์",
      "ไม่มีผลอะไรเพราะทุกคนก็ลอกกัน",
      "ทำให้ครูตรวจการบ้านง่ายขึ้นอย่างเดียว"
    ],
    "optionsScores": null,
    "optionScores": [250, 450, 100, 150],
    "bestIndex": 1
  },
  {
    "id": 15,
    "text": "การรับของขวัญจากผู้มาติดต่อราชการที่มีมูลค่าสูงควรถือว่าอย่างไร?",
    "options": [
      "ถือเป็นน้ำใจตามประเพณี",
      "อาจเข้าข่ายสินบนหรือผลประโยชน์ทับซ้อน ควรหลีกเลี่ยง",
      "รับไว้ก่อนแล้วค่อยพิจารณาทีหลัง",
      "รับได้ถ้าไม่มีใครเห็น"
    ],
    "optionScores": [100, 500, 150, 80],
    "bestIndex": 1
  },
  {
    "id": 16,
    "text": "การตั้งกติกาชัดเจนในห้องเรียนเรื่องการสอบและการบ้านช่วยป้องกันอะไร?",
    "options": [
      "ช่วยลดภาระของครู",
      "ช่วยป้องกันการโกงและสร้างความเข้าใจร่วมกัน",
      "ทำให้กติกายุ่งยากเกินไป",
      "ทำให้เพื่อนโกรธเพราะเข้มงวดเกินไป"
    ],
    "optionScores": [150, 450, 100, 120],
    "bestIndex": 1
  },
  {
    "id": 17,
    "text": "การติดป้ายประกาศงบประมาณโครงการโรงเรียนเปิดเผยต่อสาธารณะช่วยอย่างไร?",
    "options": [
      "ทำให้เอกสารดูเป็นทางการ",
      "เปิดโอกาสให้ครู นักเรียน และผู้ปกครองช่วยกันตรวจสอบ",
      "ใช้เพื่อตกแต่งบอร์ดเฉยๆ",
      "ไม่มีประโยชน์เพราะไม่มีใครอ่าน"
    ],
    "optionScores": [150, 480, 80, 70],
    "bestIndex": 1
  },
  {
    "id": 18,
    "text": "ข้อใดเป็นพฤติกรรมที่ส่งเสริมวัฒนธรรมต้านทุจริตในโรงเรียน?",
    "options": [
      "เตือนเพื่อนเมื่อเห็นว่าทำผิดกติกาอย่างสุภาพ",
      "ปล่อยผ่านเพราะเป็นเรื่องเล็กน้อย",
      "ร่วมโกงด้วยกันแต่ไม่ให้ครูรู้",
      "รู้สึกเฉยๆ เพราะคิดว่าทุกที่ก็มีการโกง"
    ],
    "optionScores": [450, 120, 80, 50],
    "bestIndex": 0
  },
  {
    "id": 19,
    "text": "หากโรงเรียนมีช่องทางรับเรื่องร้องเรียนออนไลน์ ข้อใดคือการใช้ช่องทางนี้อย่างเหมาะสม?",
    "options": [
      "ใช้เพื่อเขียนด่าเพื่อนที่ไม่ชอบ",
      "ใช้แจ้งข้อมูลที่มีหลักฐานชัดเจนเกี่ยวกับการทุจริต",
      "ใช้เพื่อขอคะแนนเพิ่ม",
      "ใช้โพสต์เรื่องส่วนตัวที่ไม่เกี่ยวกับโรงเรียน"
    ],
    "optionScores": [50, 500, 80, 70],
    "bestIndex": 1
  },
  {
    "id": 20,
    "text": "การทุจริตเล็กๆ น้อยๆ เช่น แอบเอาของโรงเรียนไปใช้ส่วนตัว ส่งผลอย่างไร?",
    "options": [
      "ไม่กระทบอะไรเพราะของมีเยอะ",
      "สะสมเป็นความเสียหาย และสร้างค่านิยมผิดให้คนรอบข้าง",
      "ถือเป็นสิทธิ์ของนักเรียน",
      "เป็นเรื่องปกติของทุกโรงเรียน"
    ],
    "optionScores": [80, 480, 100, 70],
    "bestIndex": 1
  },
  {
    "id": 21,
    "text": "การลงชื่อเข้าเรียนแทนเพื่อนถือเป็นการทุจริตในลักษณะใด?",
    "options": [
      "ทุจริตเรื่องเวลา",
      "ทุจริตข้อมูลและเอกสาร",
      "ทุจริตการเงิน",
      "ไม่ถือว่าเป็นการทุจริต"
    ],
    "optionScores": [150, 450, 100, 50],
    "bestIndex": 1
  },
  {
    "id": 22,
    "text": "หากคุณเป็นหัวหน้าห้องและพบว่าเงินกิจกรรมห้องขาดหาย ควรทำอย่างไรเป็นอันดับแรก?",
    "options": [
      "หาคนรับผิดแทนทันที",
      "รีบหาเงินมาคืนก่อนแล้วไม่ต้องบอกใคร",
      "ตรวจสอบบันทึกการรับ–จ่ายอย่างละเอียดและแจ้งครูประจำชั้น",
      "โทษเหรัญญิกทันทีว่าโกงแน่นอน"
    ],
    "optionScores": [80, 100, 500, 120],
    "bestIndex": 2
  },
  {
    "id": 23,
    "text": "ข้อใดแสดงถึงการใช้เทคโนโลยีช่วยลดการทุจริต?",
    "options": [
      "ใช้ระบบลงชื่อเข้าเรียนด้วยกระดาษ",
      "ใช้ระบบบันทึกคะแนนและงบประมาณออนไลน์ที่ตรวจสอบย้อนหลังได้",
      "เก็บข้อมูลทุกอย่างไว้ในแฟ้มส่วนตัวของครู",
      "บอกกันปากเปล่าโดยไม่บันทึกข้อมูล"
    ],
    "optionScores": [80, 480, 150, 70],
    "bestIndex": 1
  },
  {
    "id": 24,
    "text": "เหตุใดการมีส่วนร่วมของประชาชนจึงช่วยลดการทุจริตได้?",
    "options": [
      "ทำให้รัฐไม่ต้องทำงานมาก",
      "ช่วยให้การตรวจสอบกว้างขึ้นและมีหลายมุมมอง",
      "ทำให้ขั้นตอนยุ่งยากกว่าเดิม",
      "ทำให้หน่วยงานราชการเสียเวลา"
    ],
    "optionScores": [80, 480, 120, 70],
    "bestIndex": 1
  },
  {
    "id": 25,
    "text": "การให้คนใกล้ชิดได้ประโยชน์จากตำแหน่งหน้าที่ของตนเองเรียกว่าอะไร?",
    "options": [
      "การบริหารจัดการที่ดี",
      "ความจงรักภักดีต่อครอบครัว",
      "การทุจริตเชิงผลประโยชน์ทับซ้อน",
      "การพัฒนาท้องถิ่น"
    ],
    "optionScores": [80, 120, 500, 100],
    "bestIndex": 2
  },
  {
    "id": 26,
    "text": "ข้อใดคือทัศนคติที่ช่วยสร้างสังคมไม่ทนต่อการทุจริต?",
    "options": [
      "โกงนิดหน่อยไม่เป็นไร",
      "ถ้าทุกคนโกงเราก็ต้องโกงบ้าง",
      "เมื่อเห็นการทุจริต เราจะไม่เงียบและไม่ร่วมมือ",
      "ไม่ต้องสนใจเรื่องการเมืองเพราะไกลตัว"
    ],
    "optionScores": [50, 80, 500, 100],
    "bestIndex": 2
  },
  {
    "id": 27,
    "text": "การตรวจรับงานโครงการโดยมีตัวแทนหลายฝ่ายร่วมกันมีข้อดีอย่างไร?",
    "options": [
      "ทำให้เสร็จช้าลง",
      "ช่วยกระจายอำนาจการตัดสินใจและลดโอกาสสมยอมทุจริต",
      "ทำให้คนรับผิดชอบไม่ชัดเจน",
      "ทำไปเพราะเป็นพิธีการเท่านั้น"
    ],
    "optionScores": [100, 480, 150, 80],
    "bestIndex": 1
  },
  {
    "id": 28,
    "text": "เมื่อได้รับข้อมูลข่าวสารเกี่ยวกับการทุจริตจากโซเชียลมีเดีย ควรทำอย่างไร?",
    "options": [
      "แชร์ต่อทันทีเพื่อให้กระจายเร็วๆ",
      "ตรวจสอบแหล่งที่มาและข้อเท็จจริงก่อนเชื่อหรือแชร์ต่อ",
      "เชื่อทุกอย่างที่เห็น",
      "ไม่สนใจเพราะไม่เกี่ยวกับตนเอง"
    ],
    "optionScores": [100, 480, 80, 120],
    "bestIndex": 1
  },
  {
    "id": 29,
    "text": "การมีจรรยาบรรณวิชาชีพช่วยป้องกันการทุจริตในอาชีพต่างๆ อย่างไร?",
    "options": [
      "เป็นเพียงข้อเขียนในกระดาษ ไม่สำคัญ",
      "เป็นแนวทางกำกับพฤติกรรมและสร้างความรับผิดชอบต่อสังคม",
      "ทำให้คนทำงานลำบากขึ้น",
      "ใช้ได้เฉพาะในงานราชการ"
    ],
    "optionScores": [80, 500, 100, 70],
    "bestIndex": 1
  },
  {
    "id": 30,
    "text": "หากคุณต้องเป็นผู้นำรุ่นต่อไปในการต่อต้านการทุจริต สิ่งแรกที่ควรเริ่มทำคืออะไร?",
    "options": [
      "เริ่มจากการปรับตัวเองให้ซื่อสัตย์และทำสิ่งเล็กๆ ให้ถูกต้องก่อน",
      "รอให้มีตำแหน่งใหญ่ก่อนค่อยเริ่มทำ",
      "สนใจเฉพาะเมื่อมีผลประโยชน์กับตัวเอง",
      "มองว่าเรื่องทุจริตเป็นเรื่องของผู้ใหญ่เท่านั้น"
    ],
    "optionScores": [520, 80, 50, 50],
    "bestIndex": 0
  }
]
